package cmds

import (
	"chatroom/common/commands"
	"reflect"
)

////////////////////////////////////////////////////////////////////////
//                            Send 命令定义                             //
//--------------------------------------------------------------------//
// [命令名称] : send                                                    //
// [命令参数] :                                                         //
//             -msg                          发送的信息                 //
//             -user                         发送给某个用户              //
//--------------------------------------------------------------------//
// 使用案例:                                                           //
// send -user USERNAME -msg "hello!"                                  //
////////////////////////////////////////////////////////////////////////

const SendCommandName string = "send"

var SendCommand commands.Command = commands.CreateDefaultCommand(SendCommandName, reflect.TypeOf(SendData{}), SendRun)

////////////////////////////////////////////////////////////////////////
//                        主要命令参数结构体实现                          //
//--------------------------------------------------------------------//
// 实现结构体:                                                          //
//        SendData                           登录数据结构体              //
//--------------------------------------------------------------------//
// SendData                                                           //
// [公开属性] :                                                         //
//   - Username                                字符串 | 用户名          //
//   - Massage                                 字符串 | 发送的信息       //
// [私有属性] : -无-                                                    //
// [构造函数] : -无-                                                    //
// [公开函数] : -无-                                                    //
// [私有函数] : -无-                                                    //
////////////////////////////////////////////////////////////////////////

type SendData struct {
	Username string `name:"user" value:"" usage:"发送给某个用户"`
	Massage  string `name:"msg"  value:"" usage:"发送的信息"`
}

////////////////////////////////////////////////////////////////////////
//                        主要函数(runner)实现                          //
//--------------------------------------------------------------------//
// 实现函数:                                                           //
//        SendRun(params commands.Params)        发送信息处理           //
//--------------------------------------------------------------------//
// 使用的内部的参数结构体(Params.Info属性对应的结构体) ： SendRun            //
////////////////////////////////////////////////////////////////////////

func SendRun(params commands.Params) error {

	return nil
}
